src/Reports/КартаСклада.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>КартаСклада</Name>
			<Comment>Отчет рисует склад и маршрут</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИсточникМаршрута</Name>
					<Comment>Документ по которому рисуется маршрут</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.РасходныйСкладскойОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйСкладскойОрдер</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Comment>Склад</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Comment>Дата на которую выводятся остатки на складе</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Смещение</Name>
					<Comment>Смещение между слоями</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Шрифт</Name>
					<Comment>Шрифт</Comment>
					<Type>
						<v8:Type>v8ui:Font</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолщинаЛинииМаршрута</Name>
					<Comment>Толщина линии маршрута</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветЛинииМаршрута</Name>
					<Comment>Цвет линии маршрута</Comment>
					<Type>
						<v8:Type>v8ui:Color</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Принтер</Name>
					<Comment>Принтер</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОриентацияСтраницыПечати</Name>
					<Comment>Ориентация страницы печати</Comment>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолеСверху</Name>
					<Comment>Поле сверху</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолеСнизу</Name>
					<Comment>Поле снизу</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолеСлева</Name>
					<Comment>Поле слева</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолеСправа</Name>
					<Comment>Поле справа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧерноБелаяПечать</Name>
					<Comment>Истина - черно белая печать; Ложь - цветная</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазборПоКопиям</Name>
					<Comment>Истина - разобрать по копиям; Ложь - не разбирать</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДиалогПечати</Name>
					<Comment>Истина - выводить диалог печати; Ложь - не выводить</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЭкземпляров</Name>
					<Comment>Количество экземпляров</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Маcштаб</Name>
					<Comment>Масштаб</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтображатьГистограммы</Name>
					<Comment>Истина - отображать гистограммы по остаткам; Ложь - не отображать</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СохраненныеНастройки</Name>
					<Comment>Сохраненные настройки отчета</Comment>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФормыНастроек</Name>
					<Comment>Текущее имя формы настроек</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НастройкаУровней</Name>
					<Comment>Настройка видимости слоев географической схемы карты склада</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Видимость</Name>
							<Comment>Видимость</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Уровень</Name>
							<Comment>Уровень</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

src/Catalogs/ЯчейкиХранения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ЯчейкиХранения</Name>
			<Comment>Места хранения товаров на складе</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.СкладыКомпании</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДлинаЯчейки</Name>
					<Comment>Длина ячейки в единицах размерности склада-владельца</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШиринаЯчейки</Name>
					<Comment>Ширина ячейки в единицах размерности склада-владельца</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоординатаX</Name>
					<Comment>Координата X ячейки</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоординатаY</Name>
					<Comment>Координата Y ячейки</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Уровень</Name>
					<Comment>Координата Z ячейки</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветГруппы</Name>
					<Comment>Цвет ячеек, входящих в данную группу, для отображения в карте склада</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Недоступна</Name>
					<Comment>Признак доступности (активности) ячейки. Например, ячейка недоступна, если она сломана, красится и т.д.</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Reports/КартаСклада/Ext/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ ОБЪЕКТА

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

Перем СписокЦветов Экспорт; // список цветов
Перем ОбъектСклад Экспорт; // в переменную передается интерактивно открытый объект справочника Места хранения

#КонецОбласти

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОПОЛНИТЕЛЬНЫХ МЕТОДОВ ОБЪЕКТА

// Сохранение макета карты склада в реквизит типа ХранилищеЗначений
// 
// Параметры
//   ГеографическаяСхема - ГеографическаяСхема.
//
Процедура СохранитьМакет(ГеографическаяСхема)Экспорт 
	
	ИмяТемпФайла = ПолучитьИмяВременногоФайла();	
	ГеографическаяСхема.Записать(ИмяТемпФайла);	
	ДвоичныеДанные = Новый  ДвоичныеДанные(ИмяТемпФайла);
	Если ОбъектСклад = Неопределено Тогда
		НовыйОбъектСклад =  Склад.ПолучитьОбъект();
		НовыйОбъектСклад.КартаСклада = Новый ХранилищеЗначения(ДвоичныеДанные,Новый СжатиеДанных(5));
	Иначе
		ОбъектСклад.КартаСклада = Новый ХранилищеЗначения(ДвоичныеДанные,Новый СжатиеДанных(5));
	КонецЕсли;
	УдалитьФайлы(ИмяТемпФайла);
	
	Если ОбъектСклад = Неопределено  Тогда
		Попытка
			НовыйОбъектСклад.Записать();
		Исключение
			ВывестиСообщение(НСтр("ru = 'Невозможно сохранить макет карты склада. Необходимо записать'") + " " + Строка(ОбъектСклад)
				+ " " + НСтр("ru = 'и повторить действие.'"));
		КонецПопытки;
	Иначе
		Попытка
			ОбъектСклад.Записать();
		Исключение
			ВывестиСообщение(НСтр("ru = 'Невозможно сохранить макет карты склада. Необходимо записать'") + " " + Строка(ОбъектСклад)
				+ " " + НСтр("ru = 'и повторить действие.'"));
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры // СохранитьМакет()

// Чтение макета склада из реквизита типа  ХранилищеЗначений
// 
// Параметры
//   ГеографическаяСхема - ГеографическаяСхема.
//
Процедура ПрочитатьМакет(ГеографическаяСхема) Экспорт
	
	ИмяТемпФайла = ПолучитьИмяВременногоФайла();
	Склад.КартаСклада.Получить().Записать(ИмяТемпФайла);
	ГеографическаяСхема.Прочитать(ИмяТемпФайла);
	УдалитьФайлы(ИмяТемпФайла);

КонецПроцедуры // ПрочитатьМакет()

// Формируется структура объектов склада.
//
// Параметры
//   ГеографическаяСхема - ГеографическаяСхема.
//
Процедура НарисоватьСклад(ГеографическаяСхема) Экспорт 

	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЯчейкиХранения.КоординатаX КАК КоординатаX,
	|	ЯчейкиХранения.КоординатаY КАК КоординатаY,
	|	ЯчейкиХранения.Уровень КАК Уровень,
	|	ЯчейкиХранения.ДлинаЯчейки,
	|	ЯчейкиХранения.ШиринаЯчейки,
	|	ЯчейкиХранения.Код КАК Код,
	|	ЯчейкиХранения.Родитель,
	|	ЯчейкиХранения.ПометкаУдаления,
	|	ЯчейкиХранения.НеДоступна
	|ИЗ
	|	Справочник.ЯчейкиХранения КАК ЯчейкиХранения
	|ГДЕ
	|	ЯчейкиХранения.Владелец.Ссылка = &Склад
	|	И (НЕ ЯчейкиХранения.ЭтоГруппа)
	|ИТОГИ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Код)
	|ПО
	|	Уровень";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Склад",Склад);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	// Инициализация переменных.
	СчетчикПрогресса  = 0;
	ОтступРасшифровок = 10;
	
	// Читаем количество ячеек. 
	РезультатЗапроса.Следующий();
	КоличествоЯчеек = РезультатЗапроса.Количество()* РезультатЗапроса.Код;
	РезультатЗапроса.Сбросить();
	
	// Очистим слои.
	ГеографическаяСхема.Слои.Очистить();
	ПредыдущееЗначениеПрогресса = 0;
	// Обход по уровням.
	Пока РезультатЗапроса.Следующий() Цикл
				
		// Добавляем новый слой для уровня.
		Уровень =   РезультатЗапроса.Уровень;
		ИмяСлояЯчеек = "Уровень" + Строка(Уровень);
		СлойУровня = ГеографическаяСхема.Слои.Добавить(ИмяСлояЯчеек, Тип ("ПолигональныйОбъектГеографическойСхемы"));
		
		ИмяСлояРасшифровок = "Расшифровки" + Строка(Уровень);
		СлойРасшифровок =   ГеографическаяСхема.Слои.Добавить(ИмяСлояРасшифровок, Тип ("ТочечныйОбъектГеографическойСхемы"));
		
		// Запретим выделения объекта на схеме.
		СлойРасшифровок.РазрешитьВыбор = Ложь;
		
		// По тексту слой можно найти методом Найти().
		СлойУровня.Текст 		= ИмяСлояЯчеек;
		СлойРасшифровок.Текст   = ИмяСлояРасшифровок;
		
		// Серия расшифровки, значения - имена ячеек.
		СерияКодовЯчеек = СлойРасшифровок.Серии.Добавить("КодыЯчеек");
		СерияКодовЯчеек.Текст = НСтр("ru = 'Номер ячейки'");
		СерияКодовЯчеек.ТипОтображения = ТипОтображенияСерииСлояГеографическойСхемы.Текст;
		
		СерияКодовЯчеек.ШрифтТекста  = Шрифт;
		
		// Получение коллекции объектов. 
		ЯчейкиУровня =  СлойУровня.Объекты;
		РасшифровкиЯчеек = СлойРасшифровок.Объекты;
				
		// Отступы для отрисовки слоев.
		ОтШир = Уровень*Смещение;//Склад.ШиринаЯчейкиПоУмолчанию* Уровень/Смещение;
		ОтДол = Уровень*Смещение;//Склад.ДлинаЯчейкиПоУмолчанию*Уровень/Смещение;
		
		// Обход ячеек уровня.
		ВыборкаЯчейки = РезультатЗапроса.Выбрать();
		Пока ВыборкаЯчейки.Следующий() Цикл
			
			УникальноеИмяЯчейки = ВыборкаЯчейки.Код;

			НоваяРасшифровка = РасшифровкиЯчеек.Добавить();
			НоваяРасшифровка.Значение = УникальноеИмяЯчейки;
			
			НоваяЯчейка = ЯчейкиУровня.Добавить();
			НоваяЯчейка.Значение = УникальноеИмяЯчейки;
			
			Если ВыборкаЯчейки.ПометкаУдаления ИЛИ ВыборкаЯчейки.НеДоступна  Тогда
		
				НоваяЯчейка.Цвет = WebЦвета.Серый;
				
			Иначе
				
				Родитель =  ВыборкаЯчейки.Родитель;
				Если Родитель.Пустая() Тогда
					 
					Если Уровень < 20 Тогда
						НоваяЯчейка.Цвет =  СписокЦветов.Получить(Уровень).Значение;
					Иначе
						НоваяЯчейка.Цвет =  СписокЦветов.Получить(Уровень - 20*Цел(Уровень/20)).Значение;
					КонецЕсли;
				Иначе
					ЦветГруппы = Родитель.ЦветГруппы.Получить();
					Если  НЕ ЦветГруппы = Неопределено   Тогда
						НоваяЯчейка.Цвет = ЦветГруппы;
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;
			
			// Отрисовка ячейки и расшифровки.
			Контуры = НоваяЯчейка.Контуры;
			Контур = Контуры.Добавить();
			ДлинаЯчейки  =  ВыборкаЯчейки.ДлинаЯчейки;
			ШиринаЯчейки =  ВыборкаЯчейки.ШиринаЯчейки;
			
			КоординатаY = ВыборкаЯчейки.КоординатаY;
			КоординатаX = ВыборкаЯчейки.КоординатаX;
			
			Координата = Новый КоординатыГеографическойСхемы(Долгота(КоординатаX+ОтДол), Широта(КоординатаY + ОтШир));
			Контур.Добавить(Координата);
			
			Координата = Новый КоординатыГеографическойСхемы(Долгота(КоординатаX+ОтДол),Широта(КоординатаY+ШиринаЯчейки+ОтШир));
			Контур.Добавить(Координата);
						
			Координата = Новый КоординатыГеографическойСхемы(Долгота(КоординатаX +ДлинаЯчейки+ОтДол),Широта(КоординатаY +ШиринаЯчейки+ОтШир));
			Контур.Добавить(Координата);
			
			Координата = Новый КоординатыГеографическойСхемы(Долгота(КоординатаX+ДлинаЯчейки+ОтДол), Широта(КоординатаY+ОтШир ));
			Контур.Добавить(Координата);
			
			// В левом верхнем угле ячейки выведем расшифровку.
			КоординатаYРасшифровки = КоординатаY+ ШиринаЯчейки - ШиринаЯчейки/ОтступРасшифровок;
			КоординатаXРасшифровки = КоординатаX + ДлинаЯчейки/ОтступРасшифровок;

			Координата = Новый КоординатыГеографическойСхемы(Долгота(КоординатаXРасшифровки+ОтДол),Широта(КоординатаYРасшифровки+ОтШир));
			НоваяРасшифровка.Координаты = Координата;
			
			// Настройка расшифровки.
			НоваяРасшифровка.ТипОтрисовки = ТипОтображенияТочечногоОбъектаГеографическойСхемы.Символ ;
			НоваяРасшифровка.Картинка = БиблиотекаКартинок.Товары; 
			НоваяРасшифровка.Символ = "";
			
			// Для объектов расшифровки заполним серию  с именами ячеек.
			СлойРасшифровок.УстановитьЗначение(НоваяРасшифровка,СерияКодовЯчеек,СокрЛП(УникальноеИмяЯчейки));
			
		КонецЦикла;
				
	КонецЦикла;	
	
КонецПроцедуры // НарисоватьСклад()

// Возвращает географическую широту координаты
//
// Параметры
//  Долгота - число
//
// Возвращаемое значение:
//   - число
//
Функция  Широта(Расстояние)Экспорт
	
	 Возврат  Расстояние*360/40000000;

	
КонецФункции // Широта()

// Возвращает географическую долготу координаты
//
// Параметры
//  Долгота - число
//
// Возвращаемое значение:
//   - число
//
Функция Долгота(Расстояние)Экспорт
	
	Возврат  Расстояние*360/40000000;
	
КонецФункции // Долгота()

// Возвращает конвертирует  долготу в координату
//
// Параметры
//  Долгота - число
//
// Возвращаемое значение:
//   - число
//
Функция ДолготаВКоординату(Долгота)Экспорт
	
	Возврат  Долгота*40000000/360;
	
КонецФункции // ДолготаВКоординату()

#Область Инициализация

////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

СписокЦветов = Новый СписокЗначений;
СписокЦветов.Добавить(WebЦвета.Голубой);
СписокЦветов.Добавить(WebЦвета.ЗеленаяЛужайка);
СписокЦветов.Добавить(WebЦвета.Золотистый);
СписокЦветов.Добавить(WebЦвета.Золотой);
СписокЦветов.Добавить(WebЦвета.СветлоЖелтый);
СписокЦветов.Добавить(WebЦвета.ГрифельноСерый);
СписокЦветов.Добавить(WebЦвета.Лимонный);
СписокЦветов.Добавить(WebЦвета.ЛососьТемный);
СписокЦветов.Добавить(WebЦвета.Персиковый);
СписокЦветов.Добавить(WebЦвета.Хаки);
СписокЦветов.Добавить(WebЦвета.Коричневый);
СписокЦветов.Добавить(WebЦвета.Оранжевый);
СписокЦветов.Добавить(WebЦвета.ОрхидеяТемный);
СписокЦветов.Добавить(WebЦвета.Бежевый);
СписокЦветов.Добавить(WebЦвета.КрасноФиолетовый);
СписокЦветов.Добавить(WebЦвета.Циан);
СписокЦветов.Добавить(WebЦвета.Шоколадный);
СписокЦветов.Добавить(WebЦвета.НейтральноПурпурный);
СписокЦветов.Добавить(WebЦвета.Киноварь );
СписокЦветов.Добавить(WebЦвета.РыжеватоКоричневый);

#КонецОбласти
#КонецЕсли
